org-pages/spooky-tech.org
#+TITLE: Spooky Tech - Be aware of social damage...
#+DESCRIPTION: Spooky Tech - Be aware of social damage...
#+SETUPFILE:  https://luispengler.github.io/site/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: num:nil ^:{} toc:2

* Description
This page cointains a compiled list of spooky actions commited by the big tech, and reported by different sources.

The overall goal is to mantain a list of attempts to privacy harm commited by several companies throughout years.

Feel free to contact me if anything is wrong and should I add/remove something.

* Adobe
+ "Adobe has [[https://www.bleepingcomputer.com/news/software/adobe-to-ban-users-from-venezuela-due-to-us-executive-order/][cancelled the software subscriptions of all users in Venezuela.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]] (/modified/), bleepingcomputer.

+ "An upgrade package for Acrobat Reader [[https://www.bleepingcomputer.com/news/software/adobe-acrobat-reader-dc-update-installs-chrome-browser-extension/][silently alters Chrome.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], bleepingcomputer.

+ "Adobe nonfree software may halt all other work and freeze a computer [[https://shallowsky.com/blog/gimp/non-free-software-surprises.html][to perform a license check]], at a random time every 30 days." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], [[https://shallowsky.com/][shallowsky.com]].

+ "Adobe made “Digital Editions,” the e-reader used by most US libraries, [[https://web.archive.org/web/20141220181015/http://www.computerworlduk.com/blogs/open-enterprise/drm-strikes-again-3575860/][send lots of data to Adobe]]. Adobe's “excuse”: it's needed to check DRM!" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], computerworlduk.

+ "[[https://www.scientificamerican.com/article/adobe-software-subscription-model-means-you-cant-own-your-software/][Adobe tools require a subscription]]. Adobe also tried to [[https://chocolateandvodka.com/2014/02/20/adobe-creative-cloud-subscription-warning/][rip people off by making the subscriptions annual.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]] (/modified/), Scientific American, Chocolate and Vodka.

+ "Adobe applications [[https://www.wired.com/2013/05/adobe-creative-cloud-petition/][require periodic connection to a server.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], wired.

+ "Adobe applications have time bombs: they [[https://techcrunch.com/2013/05/06/adobe-goes-all-in-with-subscription-based-creative-cloud-will-stop-selling-regular-cs-licenses-shrink-wrapped-boxes/][stop working after a certain time]], after which the user must pay to extend the time. Once there was a problem with the servers that these programs use to check who has paid, and [[https://web.archive.org/web/20150120010845/http://www.macuser.co.uk/9015-adobe-creative-cloud-outage-leaves-adobe-users-locked-out][the applications refused to work for anyone.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], TechCrunch, MacUser.

