html/org-pages/spooky-tech.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-20 Wed 10:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Spooky Tech - Be aware of social damage&#x2026;</title>
<meta name="author" content="Luís Spengler" />
<meta name="description" content="Spooky Tech - Be aware of social damage..." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Spooky Tech - Be aware of social damage&#x2026;</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1d3012a">Description</a></li>
<li><a href="#org4d451a1">Adobe</a></li>
<li><a href="#org1f63929">Amazon</a></li>
<li><a href="#org5198b8b">Apple</a></li>
<li><a href="#orgf0258f1">Google</a>
<ul>
<li><a href="#org5974cf2">Android</a></li>
<li><a href="#org99dc46f">Chromebook/ChromeOS</a></li>
<li><a href="#orgaa7afdf">DRM</a></li>
<li><a href="#org3eb96ba">General actions</a></li>
<li><a href="#orgb0b0a69">Google AdSense</a></li>
<li><a href="#org3428363">Google Assistant</a></li>
<li><a href="#orga60d7c5">Google Chrome/Chromium</a></li>
<li><a href="#org8cafb52">Google Maps</a></li>
<li><a href="#org9024885">Google Meet</a></li>
<li><a href="#org9352585">Google Play Store</a></li>
<li><a href="#org32a7cab">Smart Devices</a></li>
</ul>
</li>
<li><a href="#orgc40b15b">TikTok</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1d3012a" class="outline-2">
<h2 id="org1d3012a">Description</h2>
<div class="outline-text-2" id="text-org1d3012a">
<p>
This page cointains a compiled list of spooky actions commited by the big tech, and reported by different sources.
</p>

<p>
The overall goal is to mantain a list of attempts to privacy harm commited by several companies throughout years.
</p>

<p>
Feel free to contact me if anything is wrong and should I add/remove something.
</p>
</div>
</div>

<div id="outline-container-org4d451a1" class="outline-2">
<h2 id="org4d451a1">Adobe</h2>
<div class="outline-text-2" id="text-org4d451a1">
<ul class="org-ul">
<li>&ldquo;Adobe has <a href="https://www.bleepingcomputer.com/news/software/adobe-to-ban-users-from-venezuela-due-to-us-executive-order/">cancelled the software subscriptions of all users in Venezuela.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), bleepingcomputer.</li>

<li>&ldquo;An upgrade package for Acrobat Reader <a href="https://www.bleepingcomputer.com/news/software/adobe-acrobat-reader-dc-update-installs-chrome-browser-extension/">silently alters Chrome.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, bleepingcomputer.</li>

<li>&ldquo;Adobe nonfree software may halt all other work and freeze a computer <a href="https://shallowsky.com/blog/gimp/non-free-software-surprises.html">to perform a license check</a>, at a random time every 30 days.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, <a href="https://shallowsky.com/">shallowsky.com</a>.</li>

<li>&ldquo;Adobe made “Digital Editions,” the e-reader used by most US libraries, <a href="https://web.archive.org/web/20141220181015/http://www.computerworlduk.com/blogs/open-enterprise/drm-strikes-again-3575860/">send lots of data to Adobe</a>. Adobe&rsquo;s “excuse”: it&rsquo;s needed to check DRM!&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, computerworlduk.</li>

<li>&ldquo;<a href="https://www.scientificamerican.com/article/adobe-software-subscription-model-means-you-cant-own-your-software/">Adobe tools require a subscription</a>. Adobe also tried to <a href="https://chocolateandvodka.com/2014/02/20/adobe-creative-cloud-subscription-warning/">rip people off by making the subscriptions annual.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), Scientific American, Chocolate and Vodka.</li>

<li>&ldquo;Adobe applications <a href="https://www.wired.com/2013/05/adobe-creative-cloud-petition/">require periodic connection to a server.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, wired.</li>

<li>&ldquo;Adobe applications have time bombs: they <a href="https://techcrunch.com/2013/05/06/adobe-goes-all-in-with-subscription-based-creative-cloud-will-stop-selling-regular-cs-licenses-shrink-wrapped-boxes/">stop working after a certain time</a>, after which the user must pay to extend the time. Once there was a problem with the servers that these programs use to check who has paid, and <a href="https://web.archive.org/web/20150120010845/http://www.macuser.co.uk/9015-adobe-creative-cloud-outage-leaves-adobe-users-locked-out">the applications refused to work for anyone.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, TechCrunch, MacUser.</li>
</ul>
</div>
</div>
