html/org-pages/spooky-tech.html

<div id="outline-container-org1f63929" class="outline-2">
<h2 id="org1f63929">Amazon</h2>
<div class="outline-text-2" id="text-org1f63929">
<ul class="org-ul">
<li>&ldquo;Amazon <a href="https://www.techdirt.com/articles/20150321/13350230396/while-bricking-jailbroken-fire-tvs-last-year-amazon-did-same-to-kindle-devices.shtml">downgraded the software in users&rsquo; Swindles</a> so that those already rooted would cease to function at all.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, techdirt.</li>

<li>&ldquo;The Amazon Kindle-Swindle has a back door that has been used to <a href="https://pogue.blogs.nytimes.com/2009/07/17/some-e-books-are-more-equal-than-others/">remotely erase books</a>. One of the books erased was 1984, by George Orwell.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), The New York Times.</li>

<li>&ldquo;The Amazon Ring app does <a href="https://www.theguardian.com/technology/2020/jan/29/ring-smart-doorbell-company-surveillance-eff-report">surveillance for other companies as well as for Amazon.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, The Guardian.</li>

<li>&ldquo;The Electronic Frontier Foundation has examined and found <a href="https://www.eff.org/pages/reader-privacy-chart-2012">various kinds of surveillance in the Swindle and other e-readers.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, Electronic Frontier Foundation.</li>

<li>&ldquo;Amazon&rsquo;s monopoly and DRM is <a href="https://www.washingtonpost.com/technology/2021/03/10/amazon-library-ebook-monopoly/">stopping public libraries from lending e-books and audiobooks.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), The Washington Post.</li>

<li>&ldquo;Amazon Alexa collects a lot more information from users than is necessary for correct functioning (time, location, recordings made without a legitimate prompt), and sends it to Amazon&rsquo;s servers, which store it indefinitely. Even worse, Amazon forwards it to third-party companies. Thus, even if users request deletion of their data from Amazon&rsquo;s servers, <a href="https://www.ctpost.com/business/article/Alexa-has-been-eavesdropping-on-you-this-whole-13822095.php">the data remain on other servers</a>, where they can be accessed by advertising companies and government agencies. In other words, deleting the collected information doesn&rsquo;t cancel the wrong of collecting it.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), ctpost.</li>

<li>&ldquo;Some of users&rsquo; commands to the Alexa service are <a href="https://www.smh.com.au/technology/alexa-is-someone-else-listening-to-us-sometimes-someone-is-20190411-p51d4g.html">recorded for Amazon employees to listen to.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), The Sydney Morning Herald.</li>

<li>&ldquo;A fraction of the Alexa service staff even has access to <a href="https://www.bnnbloomberg.ca/amazon-s-alexa-reviewers-can-access-customers-home-addresses-1.1248788">location and other personal data.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), BNN Bloomberg.</li>

<li>&ldquo;The Ring (now Amazon) doorbell camera is designed so that the manufacturer (now Amazon) can watch all the time. Now it turns out that <a href="https://web.archive.org/web/20190918024432/https://dojo.bullguard.com/dojo-by-bullguard/blog/ring/">anyone else can also watch, and fake videos too.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), dojo.</li>

<li>&ldquo;Amazon Ring “security” devices <a href="https://www.engadget.com/2019-01-10-ring-gave-employees-access-customer-video-feeds.html">send the video they capture to Amazon servers</a>, which save it long-term.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), engadget.</li>

<li>&ldquo;The Amazon “Smart” TV is <a href="https://www.theguardian.com/technology/shortcuts/2014/nov/09/amazon-echo-smart-tv-watching-listening-surveillance">snooping all the time.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, The Guardian.</li>
</ul>
</div>
</div>

<div id="outline-container-org5198b8b" class="outline-2">
<h2 id="org5198b8b">Apple</h2>
<div class="outline-text-2" id="text-org5198b8b">
<ul class="org-ul">
<li>&ldquo;The iPhone has a back door <a href="https://www.telegraph.co.uk/technology/3358134/Apples-Jobs-confirms-iPhone-kill-switch.html">that allows Apple to remotely delete apps</a> which Apple considers “inappropriate”.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), The Telegraph.</li>

<li>&ldquo;Apple&rsquo;s new tactic to restrict users from repairing their own device and impose DRM on people is to <a href="https://www.ifixit.com/News/54829/apples-new-screen-repair-trap-could-change-the-repair-industry-forever">completely disable its Face ID functionality</a> when you replace its screen.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, IFIXIT.</li>

<li>&ldquo;Apple is putting DRM on iPhone batteries, and the system proprietary software <a href="https://www.vice.com/en/article/59nz3k/apple-is-locking-batteries-to-specific-iphones-a-nightmare-for-diy-repair">turns off certain features when batteries are replaced other than by Apple.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, vice.</li>
</ul>
</div>
</div>
