org-pages/spooky-tech.org
** Android
+ "Android has a [[https://www.theverge.com/platform/amp/2018/9/14/17861150/google-battery-saver-android-9-pie-remote-settings-change][back door for remotely changing “user” settings]].
  The article suggests it might be a universal back door, but this isn't clear." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], the verge.

+ "In Android, [[https://www.computerworld.com/article/2506557/google-throws--kill-switch--on-android-phones.html][Google has a back door to remotely delete apps]]. (It was in a program called GTalkService, which seems since then to have been merged into Google Play.)
  Google can also [[https://jon.oberheide.org/blog/2010/06/25/remote-kill-and-install-on-google-android/][forcibly and remotely install apps]] through GTalkService. This is not equivalent to a universal back door, but permits various dirty tricks." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]] (/modified/), computerworld, Jon Oberheide.

+ "[[https://www.theguardian.com/media/2016/feb/03/google-pulls-ad-blocking-app-for-samsung-phones][Google censored installation of Samsung's ad-blocker]] on Android phones, saying that blocking ads is “interference” with the sites that advertise (and surveil users through ads)." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], The Guardian.

+ "[[https://www.theguardian.com/news/2021/jul/18/what-is-pegasus-spyware-and-how-does-it-hack-phones][The pegasus spyware used vulnerabilities on proprietary smartphone operating systems]] to impose surveillance on people. It can record people's calls, copy their messages, and secretly film them, using a security vulnerability. There's also [[https://info.lookout.com/rs/051-ESQ-475/images/lookout-pegasus-technical-analysis.pdf][a technical analysis of this spyware]] available in PDF format." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]] (/modified/), The Guardian, Lookout.

+ "Many Android apps can track users' movements even when the user says [[https://www.theverge.com/2019/7/8/20686514/android-covert-channel-permissions-data-collection-imei-ssid-location][not to allow them access to locations]]. This involves an apparently unintentional weakness in Android, exploited intentionally by malicious apps." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], the verge.

+ "A new app published by Google [[https://www.xda-developers.com/google-device-lock-controller-banks-payments/][lets banks and creditors deactivate people's Android devices]] if they fail to make payments. If someone's device gets deactivated, it will be limited to basic functionality, such as emergency calling and access to settings." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], XDA developers.

+ "Google has long had [[https://www.theguardian.com/technology/2015/nov/24/google-can-unlock-android-devices-remotely-if-phone-unencrypted][a back door to remotely unlock an Android device]], unless its disk is encrypted (possible since Android 5.0 Lollipop, but still not quite the default)." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], The Guardian.

+ "Since the beginning of 2017, [[https://qz.com/1131515/google-collects-android-users-locations-even-when-location-services-are-disabled/][Android phones have been collecting the addresses of nearby cellular towers]], even when location services are disabled, and sending that data back to Google." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], Quartz.

+ "Some Google apps on Android [[https://www.theguardian.com/technology/2018/aug/13/google-location-tracking-android-iphone-mobile][record the user's location even when users disable “location tracking”]]." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]] (/modified/), The Guardian.

+ "Android tracks location for Google [[https://www.techdirt.com/articles/20171121/09030238658/investigation-finds-google-collected-location-data-even-with-location-services-turned-off.shtml][even when “location services” are turned off, even when the phone has no SIM card.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], techdirt.

+ "Google Play (a component of Android) [[https://www.extremetech.com/mobile/235594-yes-google-play-is-tracking-you-and-thats-just-the-tip-of-a-very-large-iceberg][tracks the users' movements without their permission.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]] (/modified/), extremetech.

+ "Google Play intentionally sends app developers [[https://gadgets.ndtv.com/apps/news/google-play-store-policy-raises-privacy-concerns-331116][the personal details of users that install the app.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]] (/modified/), gadgets 360.

+ "Spyware in Android phones (and Windows? laptops): The Wall Street Journal (in an article blocked from us by a paywall) reports that [[https://www.theverge.com/2013/8/1/4580718/fbi-can-remotely-activate-android-and-laptop-microphones-reports-wsj][the FBI can remotely activate the GPS and microphone in Android phones and laptops]] (presumably Windows laptops). Here is [[https://cryptome.org/2013/08/fbi-hackers.htm][more info.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], the verge.

+ "Spyware is present in some Android devices when they are sold. Some Motorola phones, made when this company was owned by Google, use a modified version of Android that [[https://www.beneaththewaves.net/Projects/Motorola_Is_Listening.html][sends personal data to Motorola.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], Beneath the Waves.

+ "A Motorola phone (in the past motorola was owned by google...) [[https://web.archive.org/web/20170629175629/http://www.itproportal.com/2013/07/25/motorolas-new-x8-arm-chip-underpinning-the-always-on-future-of-android/][listens for voice all the time.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]] (/modified/), ITProPortal.

