html/org-pages/spooky-tech.html

<div id="outline-container-orgf0258f1" class="outline-2">
<h2 id="orgf0258f1">Google</h2>
<div class="outline-text-2" id="text-orgf0258f1">
</div>
<div id="outline-container-org5974cf2" class="outline-3">
<h3 id="org5974cf2">Android</h3>
<div class="outline-text-3" id="text-org5974cf2">
<ul class="org-ul">
<li>&ldquo;Android has a <a href="https://www.theverge.com/platform/amp/2018/9/14/17861150/google-battery-saver-android-9-pie-remote-settings-change">back door for remotely changing “user” settings</a>.
The article suggests it might be a universal back door, but this isn&rsquo;t clear.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, the verge.</li>

<li>&ldquo;In Android, <a href="https://www.computerworld.com/article/2506557/google-throws--kill-switch--on-android-phones.html">Google has a back door to remotely delete apps</a>. (It was in a program called GTalkService, which seems since then to have been merged into Google Play.)
Google can also <a href="https://jon.oberheide.org/blog/2010/06/25/remote-kill-and-install-on-google-android/">forcibly and remotely install apps</a> through GTalkService. This is not equivalent to a universal back door, but permits various dirty tricks.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), computerworld, Jon Oberheide.</li>

<li>&ldquo;<a href="https://www.theguardian.com/media/2016/feb/03/google-pulls-ad-blocking-app-for-samsung-phones">Google censored installation of Samsung&rsquo;s ad-blocker</a> on Android phones, saying that blocking ads is “interference” with the sites that advertise (and surveil users through ads).&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, The Guardian.</li>

<li>&ldquo;<a href="https://www.theguardian.com/news/2021/jul/18/what-is-pegasus-spyware-and-how-does-it-hack-phones">The pegasus spyware used vulnerabilities on proprietary smartphone operating systems</a> to impose surveillance on people. It can record people&rsquo;s calls, copy their messages, and secretly film them, using a security vulnerability. There&rsquo;s also <a href="https://info.lookout.com/rs/051-ESQ-475/images/lookout-pegasus-technical-analysis.pdf">a technical analysis of this spyware</a> available in PDF format.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), The Guardian, Lookout.</li>

<li>&ldquo;Many Android apps can track users&rsquo; movements even when the user says <a href="https://www.theverge.com/2019/7/8/20686514/android-covert-channel-permissions-data-collection-imei-ssid-location">not to allow them access to locations</a>. This involves an apparently unintentional weakness in Android, exploited intentionally by malicious apps.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, the verge.</li>

<li>&ldquo;A new app published by Google <a href="https://www.xda-developers.com/google-device-lock-controller-banks-payments/">lets banks and creditors deactivate people&rsquo;s Android devices</a> if they fail to make payments. If someone&rsquo;s device gets deactivated, it will be limited to basic functionality, such as emergency calling and access to settings.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, XDA developers.</li>

<li>&ldquo;Google has long had <a href="https://www.theguardian.com/technology/2015/nov/24/google-can-unlock-android-devices-remotely-if-phone-unencrypted">a back door to remotely unlock an Android device</a>, unless its disk is encrypted (possible since Android 5.0 Lollipop, but still not quite the default).&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, The Guardian.</li>

<li>&ldquo;Since the beginning of 2017, <a href="https://qz.com/1131515/google-collects-android-users-locations-even-when-location-services-are-disabled/">Android phones have been collecting the addresses of nearby cellular towers</a>, even when location services are disabled, and sending that data back to Google.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, Quartz.</li>

<li>&ldquo;Some Google apps on Android <a href="https://www.theguardian.com/technology/2018/aug/13/google-location-tracking-android-iphone-mobile">record the user&rsquo;s location even when users disable “location tracking”</a>.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), The Guardian.</li>

<li>&ldquo;Android tracks location for Google <a href="https://www.techdirt.com/articles/20171121/09030238658/investigation-finds-google-collected-location-data-even-with-location-services-turned-off.shtml">even when “location services” are turned off, even when the phone has no SIM card.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, techdirt.</li>

<li>&ldquo;Google Play (a component of Android) <a href="https://www.extremetech.com/mobile/235594-yes-google-play-is-tracking-you-and-thats-just-the-tip-of-a-very-large-iceberg">tracks the users&rsquo; movements without their permission.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), extremetech.</li>

<li>&ldquo;Google Play intentionally sends app developers <a href="https://gadgets.ndtv.com/apps/news/google-play-store-policy-raises-privacy-concerns-331116">the personal details of users that install the app.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), gadgets 360.</li>

<li>&ldquo;Spyware in Android phones (and Windows? laptops): The Wall Street Journal (in an article blocked from us by a paywall) reports that <a href="https://www.theverge.com/2013/8/1/4580718/fbi-can-remotely-activate-android-and-laptop-microphones-reports-wsj">the FBI can remotely activate the GPS and microphone in Android phones and laptops</a> (presumably Windows laptops). Here is <a href="https://cryptome.org/2013/08/fbi-hackers.htm">more info.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, the verge.</li>

<li>&ldquo;Spyware is present in some Android devices when they are sold. Some Motorola phones, made when this company was owned by Google, use a modified version of Android that <a href="https://www.beneaththewaves.net/Projects/Motorola_Is_Listening.html">sends personal data to Motorola.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, Beneath the Waves.</li>

<li>&ldquo;A Motorola phone (in the past motorola was owned by google&#x2026;) <a href="https://web.archive.org/web/20170629175629/http://www.itproportal.com/2013/07/25/motorolas-new-x8-arm-chip-underpinning-the-always-on-future-of-android/">listens for voice all the time.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), ITProPortal.</li>
</ul>
</div>
</div>
