org-pages/spooky-tech.org
** Chromebook/ChromeOS
+ "ChromeBooks are programmed for obsolescence: ChromeOS has a universal back door that is used for updates and [[https://www.theregister.com/2019/08/22/buying_a_chromebook_dont_forget_to_check_when_it_expires/][ceases to operate at a predefined date]]. From then on, there appears to be no support whatsoever for the computer. In other words, when you stop getting screwed by the back door, you start getting screwed by the obsolescence." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], The Register.

+ "ChromeOS has a universal back door. At least, Google says it does—in [[https://www.google.com/intl/en/chromebook/termsofservice.html][section 4 of the EULA.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], Google.

+ "Low-priced Chromebooks for schools are [[https://www.eff.org/wp/school-issued-devices-and-student-privacy][collecting far more data on students than is necessary, and store it indefinitely]]. Parents and students complain about the lack of transparency on the part of both the educational services and the schools, the difficulty of opting out of these services, and the lack of proper privacy policies, among other things." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]] (/modified/), Electronic Frontier Foundation.

** DRM
=Digital restrictions management, or “DRM,” refers to functionalities designed to restrict what users can do with the data in their computers.=
+ "Google now allows Android apps to detect whether a device has been rooted, [[https://www.androidpolice.com/2017/05/13/netflix-confirms-blocking-rootedunlocked-devices-app-still-working-now/][and refuse to install if so]]. The Netflix app uses this ability to enforce DRM by refusing to install on rooted Android devices. Update: Google intentionally changed Android so that apps [[https://torrentfreak.com/netflix-use-of-google-drm-means-rooted-android-devices-are-banned-170515/][can detect rooted devices and refuse to run on them]]. The Netflix app is proprietary malware, and one shouldn't use it. However, that does not make what Google has done any less wrong." Source: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], Android Police, torrentfreak.

+ "Chrome [[https://boingboing.net/2017/01/30/google-quietly-makes-optiona.html][implements DRM]]. So does Chromium, through nonfree software that is effectively part of it. [[https://bugs.chromium.org/p/chromium/issues/detail?id=686430][More information.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], boingboing, [[https://bugs.chromium.org/p/chromium/issues/list][bugs.chromium.org]].

+ "Android [[https://developer.android.com/reference/android/drm/package-summary.html][contains facilities specifically to support DRM.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], Android Developers.

** General actions
+ "Google [[https://www.indiatoday.in/technology/news/story/disha-ravi-arrest-puts-privacy-of-all-google-india-users-in-doubt-1769772-2021-02-16][handed over personal data of Indian protesters and activists to Indian police]] which led to their arrest. The cops requested the IP address and the location where a document was created and with that information, they identified protesters and activists." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], India Today.

+ "Google, Apple, and Microsoft (and probably some other companies) [[https://www.lifewire.com/wifi-positioning-system-1683343][are collecting people's access points and GPS coordinates (which can identify people's precise location) even if their GPS is turned off]], without the person's consent, using proprietary software implemented in person's smartphone. Though merely asking for permission would not necessarily legitimize this." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], LifeWire.

+ "An Android phone was observed to track location even while in airplane mode. It didn't send the location data while in airplane mode. Instead, [[https://www.thesun.co.uk/tech/7811918/google-is-tracking-you-even-with-airplane-mode-turned-on/][it saved up the data, and sent them all later.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], The Sun.

+ "[[https://www.theverge.com/2018/8/13/17684660/google-turn-off-location-history-data][Google will track people even if people turn off location history]], using Google Maps, weather updates, and browser searches. Google basically uses any app activity to track people." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], the verge.

+ "Google's new voice messaging app [[https://www.theverge.com/2016/9/21/12994362/allo-privacy-message-logs-google][logs all conversations.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], the verge.

+ "Many web sites report all their visitors to Google by using the Google Analytics service, which [[https://www.pcworld.idg.com.au/article/434164/google_analytics_breaks_norwegian_privacy_laws_local_agency_said/][tells Google the IP address and the page that was visited.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], PCWorld.

** Google AdSense
+ "Tiny Lab Productions, along with online ad businesses run by Google, Twitter and three other companies are facing a lawsuit [[https://www.nytimes.com/interactive/2018/09/12/technology/kids-apps-data-privacy-google-twitter.html][for violating people's privacy by collecting their data from mobile games and handing over these data to other companies/advertisers.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], New York Times.

** Google Assistant
+ "Google “Assistant” records users' conversations [[https://arstechnica.com/information-technology/2019/07/google-defends-listening-to-ok-google-queries-after-voice-recordings-leak/][even when it is not supposed to listen]]. Thus, when one of Google's subcontractors discloses a thousand confidential voice recordings, users were easily identified from these recordings." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]] (/modified/), arstechnica.

