html/org-pages/spooky-tech.html

<div id="outline-container-org99dc46f" class="outline-3">
<h3 id="org99dc46f">Chromebook/ChromeOS</h3>
<div class="outline-text-3" id="text-org99dc46f">
<ul class="org-ul">
<li>&ldquo;ChromeBooks are programmed for obsolescence: ChromeOS has a universal back door that is used for updates and <a href="https://www.theregister.com/2019/08/22/buying_a_chromebook_dont_forget_to_check_when_it_expires/">ceases to operate at a predefined date</a>. From then on, there appears to be no support whatsoever for the computer. In other words, when you stop getting screwed by the back door, you start getting screwed by the obsolescence.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, The Register.</li>

<li>&ldquo;ChromeOS has a universal back door. At least, Google says it does—in <a href="https://www.google.com/intl/en/chromebook/termsofservice.html">section 4 of the EULA.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, Google.</li>

<li>&ldquo;Low-priced Chromebooks for schools are <a href="https://www.eff.org/wp/school-issued-devices-and-student-privacy">collecting far more data on students than is necessary, and store it indefinitely</a>. Parents and students complain about the lack of transparency on the part of both the educational services and the schools, the difficulty of opting out of these services, and the lack of proper privacy policies, among other things.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), Electronic Frontier Foundation.</li>
</ul>
</div>
</div>

<div id="outline-container-orgaa7afdf" class="outline-3">
<h3 id="orgaa7afdf">DRM</h3>
<div class="outline-text-3" id="text-orgaa7afdf">
<p>
<code>Digital restrictions management, or “DRM,” refers to functionalities designed to restrict what users can do with the data in their computers.</code>
</p>
<ul class="org-ul">
<li>&ldquo;Google now allows Android apps to detect whether a device has been rooted, <a href="https://www.androidpolice.com/2017/05/13/netflix-confirms-blocking-rootedunlocked-devices-app-still-working-now/">and refuse to install if so</a>. The Netflix app uses this ability to enforce DRM by refusing to install on rooted Android devices. Update: Google intentionally changed Android so that apps <a href="https://torrentfreak.com/netflix-use-of-google-drm-means-rooted-android-devices-are-banned-170515/">can detect rooted devices and refuse to run on them</a>. The Netflix app is proprietary malware, and one shouldn&rsquo;t use it. However, that does not make what Google has done any less wrong.&rdquo; Source: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, Android Police, torrentfreak.</li>

<li>&ldquo;Chrome <a href="https://boingboing.net/2017/01/30/google-quietly-makes-optiona.html">implements DRM</a>. So does Chromium, through nonfree software that is effectively part of it. <a href="https://bugs.chromium.org/p/chromium/issues/detail?id=686430">More information.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, boingboing, <a href="https://bugs.chromium.org/p/chromium/issues/list">bugs.chromium.org</a>.</li>

<li>&ldquo;Android <a href="https://developer.android.com/reference/android/drm/package-summary.html">contains facilities specifically to support DRM.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, Android Developers.</li>
</ul>
</div>
</div>

<div id="outline-container-org3eb96ba" class="outline-3">
<h3 id="org3eb96ba">General actions</h3>
<div class="outline-text-3" id="text-org3eb96ba">
<ul class="org-ul">
<li>&ldquo;Google <a href="https://www.indiatoday.in/technology/news/story/disha-ravi-arrest-puts-privacy-of-all-google-india-users-in-doubt-1769772-2021-02-16">handed over personal data of Indian protesters and activists to Indian police</a> which led to their arrest. The cops requested the IP address and the location where a document was created and with that information, they identified protesters and activists.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, India Today.</li>

<li>&ldquo;Google, Apple, and Microsoft (and probably some other companies) <a href="https://www.lifewire.com/wifi-positioning-system-1683343">are collecting people&rsquo;s access points and GPS coordinates (which can identify people&rsquo;s precise location) even if their GPS is turned off</a>, without the person&rsquo;s consent, using proprietary software implemented in person&rsquo;s smartphone. Though merely asking for permission would not necessarily legitimize this.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, LifeWire.</li>

<li>&ldquo;An Android phone was observed to track location even while in airplane mode. It didn&rsquo;t send the location data while in airplane mode. Instead, <a href="https://www.thesun.co.uk/tech/7811918/google-is-tracking-you-even-with-airplane-mode-turned-on/">it saved up the data, and sent them all later.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, The Sun.</li>

<li>&ldquo;<a href="https://www.theverge.com/2018/8/13/17684660/google-turn-off-location-history-data">Google will track people even if people turn off location history</a>, using Google Maps, weather updates, and browser searches. Google basically uses any app activity to track people.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, the verge.</li>

<li>&ldquo;Google&rsquo;s new voice messaging app <a href="https://www.theverge.com/2016/9/21/12994362/allo-privacy-message-logs-google">logs all conversations.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, the verge.</li>

<li>&ldquo;Many web sites report all their visitors to Google by using the Google Analytics service, which <a href="https://www.pcworld.idg.com.au/article/434164/google_analytics_breaks_norwegian_privacy_laws_local_agency_said/">tells Google the IP address and the page that was visited.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, PCWorld.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb0b0a69" class="outline-3">
<h3 id="orgb0b0a69">Google AdSense</h3>
<div class="outline-text-3" id="text-orgb0b0a69">
<ul class="org-ul">
<li>&ldquo;Tiny Lab Productions, along with online ad businesses run by Google, Twitter and three other companies are facing a lawsuit <a href="https://www.nytimes.com/interactive/2018/09/12/technology/kids-apps-data-privacy-google-twitter.html">for violating people&rsquo;s privacy by collecting their data from mobile games and handing over these data to other companies/advertisers.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, New York Times.</li>
</ul>
</div>
</div>

<div id="outline-container-org3428363" class="outline-3">
<h3 id="org3428363">Google Assistant</h3>
<div class="outline-text-3" id="text-org3428363">
<ul class="org-ul">
<li>&ldquo;Google “Assistant” records users&rsquo; conversations <a href="https://arstechnica.com/information-technology/2019/07/google-defends-listening-to-ok-google-queries-after-voice-recordings-leak/">even when it is not supposed to listen</a>. Thus, when one of Google&rsquo;s subcontractors discloses a thousand confidential voice recordings, users were easily identified from these recordings.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), arstechnica.</li>
</ul>
</div>
</div>
