org-pages/spooky-tech.org
** Google Chrome/Chromium
+ "On Windows and MacOS, Chrome [[https://sites.google.com/a/chromium.org/dev/developers/extensions-deployment-faq][disables extensions]] that are not hosted in the Chrome Web Store. For example, an extension was [[https://web.archive.org/web/20170120094917/https://consumerist.com/2017/01/18/why-is-google-blocking-this-ad-blocker-on-chrome/][banned from the Chrome Web Store, and permanently disabled]] on more than 40,000 computers." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], The Chromium Projects, consumerist.

+ "Google is modifying Chromium so that [[https://tech.slashdot.org/story/19/01/23/0048202/google-proposes-changes-to-chromium-browser-that-will-break-content-blocking-extensions-including-various-ad-blockers][extensions won't be able to alter or block whatever the page contains.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]] (/modified/), Slashdot.

+ "Google's proprietary Chrome web browser [[https://www.techrepublic.com/article/new-chrome-feature-can-tell-sites-and-webapps-when-youre-idle/][added a surveillance API (idle detection API)]] which lets websites ask Chrome to report when a user with a web page open is idle." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], TechRepublic.

+ "Google Chrome is an [[https://www.mercurynews.com/2019/06/21/google-chrome-has-become-surveillance-software-its-time-to-switch/][instrument of surveillance]]. It lets thousands of trackers invade users' computers and report the sites they visit to advertising and data companies, first of all to Google. Moreover, if users have a Gmail account, Chrome automatically logs them in to the browser for more convenient profiling. On Android, Chrome also reports their location to Google." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]] (/modified/), The Mercury News.

+ "Google Chrome makes it easy for an extension to do [[https://labs.detectify.com/2015/07/28/how-i-disabled-your-chrome-security-extensions/][total snooping on the user's browsing]], and many of them do so." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], detectify.

+ "Google Chrome includes a module that [[https://www.privateinternetaccess.com/blog/google-chrome-listening-in-to-your-room-shows-the-importance-of-privacy-defense-in-depth/][activates microphones and transmits audio to its servers.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], piablog.

+ "Google Chrome [[https://www.brad-x.com/2013/08/04/google-chrome-is-spyware/][spies on browser history, affiliations]], and other installed software." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], bradx.

+ "Google Chrome contains a key logger that [[https://web.archive.org/web/20190126075111/http://www.favbrowser.com/google-chrome-spyware-confirmed/][sends Google every URL typed in]], one key at a time." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], FavBrowser.com.

** Google Maps
+ "Google tracks the movements of Android phones and iPhones running Google apps, and sometimes [[https://www.nytimes.com/interactive/2019/04/13/us/google-location-tracking-police.html][saves the data for years.]]" Source: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]] (/modified/), New York Times.

** Google Meet
+ "Proprietary programs Google Meet, Microsoft Teams, and WebEx [[https://www.consumerreports.org/video-conferencing-services/videoconferencing-privacy-issues-google-microsoft-webex-a7383469308/][are collecting user's personal and identifiable data]] including how long a call lasts, who's participating in the call, and the IP addresses of everyone taking part. From experience, this can even harm users physically if those companies hand over data to governments." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], ConsumerReports.

** Google Play Store
+ "The [[https://play.google.com/about/play-terms/][Google Play Terms of Service]] insist that the user of Android accept the presence of universal back doors in apps released by Google. This does not tell us whether any of Google's apps currently contains a universal back door, but that is a secondary question. In moral terms, demanding that people accept in advance certain bad treatment is equivalent to actually doing it. Whatever condemnation the latter deserves, the former deserves the same." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], [[https://play.google.com][play.google.com]].

** Smart Devices
+ "Google Nest [[https://blog.google/products/google-nest/partnership-adt-smarter-home-security/][is taking over ADT]]. Google sent out a software update to its speaker devices using their back door [[https://www.protocol.com/google-smart-speaker-alarm-adt][that listens for things like smoke alarms]] and then notifies your phone that an alarm is happening. This means the devices now listen for more than just their wake words. Google says the software update was sent out prematurely and on accident and Google was planning on disclosing this new feature and offering it to customers who pay for it." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], blog.google, protocol.

+ "Nest thermometers send [[https://bgr.com/general/google-nest-jailbreak-hack/][a lot of data about the user.]]" Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], BGR.

* TikTok
+ "TikTok [[https://boingboing.net/2020/08/11/tiktok-exploited-android-secur.html][exploited an Android vulnerability]] to obtain user MAC addresses." Sources: [[https://www.gnu.org/proprietary/malware-google.html#content][gnu.org]], boingboing.
