html/org-pages/spooky-tech.html

<div id="outline-container-orga60d7c5" class="outline-3">
<h3 id="orga60d7c5">Google Chrome/Chromium</h3>
<div class="outline-text-3" id="text-orga60d7c5">
<ul class="org-ul">
<li>&ldquo;On Windows and MacOS, Chrome <a href="https://sites.google.com/a/chromium.org/dev/developers/extensions-deployment-faq">disables extensions</a> that are not hosted in the Chrome Web Store. For example, an extension was <a href="https://web.archive.org/web/20170120094917/https://consumerist.com/2017/01/18/why-is-google-blocking-this-ad-blocker-on-chrome/">banned from the Chrome Web Store, and permanently disabled</a> on more than 40,000 computers.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, The Chromium Projects, consumerist.</li>

<li>&ldquo;Google is modifying Chromium so that <a href="https://tech.slashdot.org/story/19/01/23/0048202/google-proposes-changes-to-chromium-browser-that-will-break-content-blocking-extensions-including-various-ad-blockers">extensions won&rsquo;t be able to alter or block whatever the page contains.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), Slashdot.</li>

<li>&ldquo;Google&rsquo;s proprietary Chrome web browser <a href="https://www.techrepublic.com/article/new-chrome-feature-can-tell-sites-and-webapps-when-youre-idle/">added a surveillance API (idle detection API)</a> which lets websites ask Chrome to report when a user with a web page open is idle.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, TechRepublic.</li>

<li>&ldquo;Google Chrome is an <a href="https://www.mercurynews.com/2019/06/21/google-chrome-has-become-surveillance-software-its-time-to-switch/">instrument of surveillance</a>. It lets thousands of trackers invade users&rsquo; computers and report the sites they visit to advertising and data companies, first of all to Google. Moreover, if users have a Gmail account, Chrome automatically logs them in to the browser for more convenient profiling. On Android, Chrome also reports their location to Google.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), The Mercury News.</li>

<li>&ldquo;Google Chrome makes it easy for an extension to do <a href="https://labs.detectify.com/2015/07/28/how-i-disabled-your-chrome-security-extensions/">total snooping on the user&rsquo;s browsing</a>, and many of them do so.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, detectify.</li>

<li>&ldquo;Google Chrome includes a module that <a href="https://www.privateinternetaccess.com/blog/google-chrome-listening-in-to-your-room-shows-the-importance-of-privacy-defense-in-depth/">activates microphones and transmits audio to its servers.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, piablog.</li>

<li>&ldquo;Google Chrome <a href="https://www.brad-x.com/2013/08/04/google-chrome-is-spyware/">spies on browser history, affiliations</a>, and other installed software.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, bradx.</li>

<li>&ldquo;Google Chrome contains a key logger that <a href="https://web.archive.org/web/20190126075111/http://www.favbrowser.com/google-chrome-spyware-confirmed/">sends Google every URL typed in</a>, one key at a time.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, FavBrowser.com.</li>
</ul>
</div>
</div>

<div id="outline-container-org8cafb52" class="outline-3">
<h3 id="org8cafb52">Google Maps</h3>
<div class="outline-text-3" id="text-org8cafb52">
<ul class="org-ul">
<li>&ldquo;Google tracks the movements of Android phones and iPhones running Google apps, and sometimes <a href="https://www.nytimes.com/interactive/2019/04/13/us/google-location-tracking-police.html">saves the data for years.</a>&rdquo; Source: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a> (<i>modified</i>), New York Times.</li>
</ul>
</div>
</div>

<div id="outline-container-org9024885" class="outline-3">
<h3 id="org9024885">Google Meet</h3>
<div class="outline-text-3" id="text-org9024885">
<ul class="org-ul">
<li>&ldquo;Proprietary programs Google Meet, Microsoft Teams, and WebEx <a href="https://www.consumerreports.org/video-conferencing-services/videoconferencing-privacy-issues-google-microsoft-webex-a7383469308/">are collecting user&rsquo;s personal and identifiable data</a> including how long a call lasts, who&rsquo;s participating in the call, and the IP addresses of everyone taking part. From experience, this can even harm users physically if those companies hand over data to governments.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, ConsumerReports.</li>
</ul>
</div>
</div>

<div id="outline-container-org9352585" class="outline-3">
<h3 id="org9352585">Google Play Store</h3>
<div class="outline-text-3" id="text-org9352585">
<ul class="org-ul">
<li>&ldquo;The <a href="https://play.google.com/about/play-terms/">Google Play Terms of Service</a> insist that the user of Android accept the presence of universal back doors in apps released by Google. This does not tell us whether any of Google&rsquo;s apps currently contains a universal back door, but that is a secondary question. In moral terms, demanding that people accept in advance certain bad treatment is equivalent to actually doing it. Whatever condemnation the latter deserves, the former deserves the same.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, <a href="https://play.google.com">play.google.com</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org32a7cab" class="outline-3">
<h3 id="org32a7cab">Smart Devices</h3>
<div class="outline-text-3" id="text-org32a7cab">
<ul class="org-ul">
<li>&ldquo;Google Nest <a href="https://blog.google/products/google-nest/partnership-adt-smarter-home-security/">is taking over ADT</a>. Google sent out a software update to its speaker devices using their back door <a href="https://www.protocol.com/google-smart-speaker-alarm-adt">that listens for things like smoke alarms</a> and then notifies your phone that an alarm is happening. This means the devices now listen for more than just their wake words. Google says the software update was sent out prematurely and on accident and Google was planning on disclosing this new feature and offering it to customers who pay for it.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, blog.google, protocol.</li>

<li>&ldquo;Nest thermometers send <a href="https://bgr.com/general/google-nest-jailbreak-hack/">a lot of data about the user.</a>&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, BGR.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc40b15b" class="outline-2">
<h2 id="orgc40b15b">TikTok</h2>
<div class="outline-text-2" id="text-orgc40b15b">
<ul class="org-ul">
<li>&ldquo;TikTok <a href="https://boingboing.net/2020/08/11/tiktok-exploited-android-secur.html">exploited an Android vulnerability</a> to obtain user MAC addresses.&rdquo; Sources: <a href="https://www.gnu.org/proprietary/malware-google.html#content">gnu.org</a>, boingboing.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Spengler</p>
<p class="date">Created: 2022-04-20 Wed 10:02</p>
</div>
</body>
</html>
